<?php

namespace SyncBasalam\Admin\Product\Utils;

defined('ABSPATH') || exit;

class ProductUnits
{
    public static function all(): array
    {
        return [
            '6304' => 'عددی',
            '6305' => 'کیلو‌گرم',
            '6306' => 'گرم',
            '6307' => 'متر',
            '6308' => 'سانتی‌متر',
            '6309' => 'مثقال',
            '6310' => 'تکه (اسلایس)',
            '6311' => 'لیتر',
            '6312' => 'میلی‌لیتر',
            '6313' => 'سی‌سی',
            '6314' => 'انس',
            '6315' => 'قواره',
            '6316' => 'طاقه',
            '6317' => 'جین',
            '6318' => 'جفت',
            '6319' => 'بسته',
            '6320' => 'توپ',
            '6321' => 'کارتن',
            '6322' => 'تخته',
            '6323' => 'بطری',
            '6324' => 'دست',
            '6325' => 'بوته',
            '6326' => 'شاخه',
            '6327' => 'قالب',
            '6328' => 'کلاف',
            '6329' => 'اصله',
            '6330' => 'سیر',
            '6331' => 'اینچ',
            '6332' => 'فوت',
            '6373' => 'جلد',
            '6374' => 'میلی‌متر',
            '6375' => 'مترمربع',
            '6392' => 'رول',
            '6438' => 'سوت',
            '6466' => 'قیراط',
        ];
    }
}
